"use client";

import { Button } from "@/components/ui/button";
import { motion } from "framer-motion";

const reactvsnext = () => {
  return <motion.section
      initial={{ opacity: 0 }}
      animate={{
        opacity: 1,
        transition: { delay: 2.4, duration: 0.4, ease: "easeIn" },
      }}
      className="py-1 flex flex-col gap-5 m-3 container mx-auto"
    >
      {/* title */}
      <div className="flex justify-between border rounded-md px-3 items-center">
        <div className="font-bold text-accent">ReactJs یا NextJs
        </div>
        </div>
        {/* banner */}
      <div className="container mx-auto px-0">
      <img className="h-[300px] w-full rounded-xl object-cover shadow-xl shadow-black/40" src="/images/react-vs-next-technoraspberry.png" alt="" />
      </div>
      {/* data */}
      <h2 className="text-accent text-4xl text-center my-8">ReactJs یا NextJs</h2><p className="text-justify px-3">در دنیای برنامه نویسی وب فریمورک ها و کتابخانه های مختلفی وجود دارند که به برنامه نویسان کمک میکنند تا برنامه های وب پویا و عالی ایجاد کنند .که از مهم ترین این ابزار ها ریکت جی اس و نکست جی اس هستند.
1. ریکت جی اس:

یک کتابخانه جاوااسکریپتی است برای توسعه رابط کاربری که توسط فیسبوک توسعه داده شده است.
از مهم ترین قابلیت های ریکت می توان به موارد زیر اشاره کرد:

امکان توسعه سینگل پیج اپلیکیشن :
یک برنامه تحت وب که بصورت داینامیک با کاربر در ارتباط است و درخواست های کاربران را بدون بارگذاری مجدد تمام صفحه، پاسخ می دهد را یک برنامه تک صفحه ای می گویند

امکان تقسیم ویو به اجزا مختلف به نام کامپوننت

رندر سمت کاربر:
وقتی ما یک دامنه را در گوگل سرچ میکنیم چه اتفاقی می افتد؟
برای پاسخ به این سوال بیایید ببینیم که یک صفحه وب چگونه کار میکند:
اینت :
دستگاه متصل به اینترنت کاربران معمولی وب است . مثل کامپیوتر شما که به اینترنت متصل است.
سرور:
سرور ها کامپیوتر هایی هستند که صفحات وب را ذخیره میکنند . وهنگامی که یک کلاینت میخواهد به صفحه وب دسترسی پیدا کند یک نسخه از صفحه وب برای کلاینت ارسال میشود .
حالا وقتی که شما یک دامنه را در مرورگر خود تایپ میکنید مرورگر آدرس سروری که وبسایت مورد نظر در آن قرار دارد را پیدا می کند و یک اچ تی تی پی ریکوست به سرور ارسال میکند و درخواست میکند که یک کپی از وب سایت برای کلاینت ارسال شود .
در حالتی که ما رندر سمت کاربر دارییم سرور یک کپی از وب سایت را به صورت تکه های کوچک که بسته داده نامیده میشوند ،برای مرورگر ارسال میکند و مرورگر این تکه های کوچک را در قالب یک صفحه وب کامل جمع آوری میکند . درواقع مرورگر با استفاده از بسته های داده ارسال شده توسط سرور ، صفحه وب را در دستگاه کاربر ایجاد می کند . که به آن رندر سمت کاربر میگوییم .
وقتی که رندر سمت کاربر اتفاق می افتد چون در این حالت هرچه که لازم است نمایش داده شود در مرورگر کلاینت ایجاد میشود ، وقتی کرالر یا همون خزنده برای خواندن مطالب ما می آید چیزی جز یک کانتینر خالی نخواهد دید در نتیجه در حالت رندر سمت کاربر ما عملا سئو را از دست می دهیم.</p></motion.section>
};

export default reactvsnext;
